#+TITLE: Multiple GitHub Accounts
#+SETUPFILE: ../setup.org

*/The Problem/*: You have multiple GitHub accounts, and you want to git to
automatically use a particular account depending on what directory a project is
in.

In this article I'll use two GitHub accounts as an example: *work* and *home*
(but the idea supports any number of accounts). You'd like to use your /home/
account for personal projects and your /work/ account for work. Here we set
things up so that:

- Projects in =~/work/...= use the *work* GitHub account
- Projects located anywhere else use the *home* GitHub account

This is all just git and ssh configuration; no editor-specific configuration
should be required (since editors should be shelling out to git anyway).

** Background: Git URL rewriting

   To take a closer look at what this part of /home.gitconfig/ means:

   #+begin_src gitconfig
     [url "git@github-home"]
         insteadOf = git@github.com
   #+end_src

   Here I've said: "Mr. Git, any time you see a URL that starts with
   =git@github.com=, please just pretend like the URL actually starts with
   =git@github-home=".

   For example, let's see what git thinks about the repository where I'm writing
   [[https://github.com/cfclrk/articles][this article]]. If I just =cat= the git config file in my local /articles/
   repo, I see the real remote URL:

   #+begin_src bash :results output
     cat .git/config | grep "\[remote" -A 2
   #+end_src

   #+RESULTS:
   : [remote "origin"]
   : 	url = git@github.com:cfclrk/articles.git
   : 	fetch = +refs/heads/*:refs/remotes/origin/*

   But when I use the =git remote= command line to view that value, I see this:

   #+begin_src bash :results output
     git remote -v
   #+end_src

   #+RESULTS:
   : origin	git@github-home:cfclrk/articles.git (fetch)
   : origin	git@github-home:cfclrk/articles.git (push)

   We can see that =git remote= shows the rewritten URL. Git performs the
   url-rewriting at a really low level, so all git commands see the rewritten
   form.

   The value I chose -- in this case "github-home" -- could have been anything
   (well, anything without spaces, etc). It doesn't matter so much /what/ the
   value is, it just matters that you use the /same/ value in your git config
   and in your SSH config (as explained in the section [[#the-ssh-config]]).

